tap "homebrew/services"
tap "redis/redis"
brew "libssh2"
brew "bat"
brew "cmake"
brew "code2prompt"
brew "ripgrep"
brew "codex"
brew "rtmpdump"
brew "curl"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "golang-migrate"
brew "golangci-lint"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libpq"
brew "micro"
brew "mockery"
brew "nvm"
brew "openldap"
brew "openssl@1.1"
brew "pipx"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "pyenv"
brew "resvg"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tlrc"
brew "tmux"
brew "vhs"
brew "wget"
brew "xh"
brew "yazi"
brew "zoxide"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "pearcleaner"
cask "redis/redis/redis"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-ceintl.vscode-language-pack-ru"
vscode "openai.chatgpt"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/josharian/impl"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/tools/cmd/stringer"
